# SF Salaries Exercise

**Import pandas as pd.**

In [1]:
import pandas as pd
from warnings import filterwarnings
filterwarnings('ignore')

**Read Salaries.csv as a dataframe called sal.**

In [2]:
df = pd.read_csv("Salaries.csv")
df

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

**Check the head of the DataFrame.**

In [3]:
df.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

**Use the .info() method to check datatype of columns**

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

**Check values of the follwing columns and see if there datatypes are suitable:**
- BasePay
- OvertimePay

**BasePay**

In [5]:
df["BasePay"] # it's not suitable becuase it is an object numbers

0            167411.18
1            155966.02
2            212739.13
3              77916.0
4             134401.6
              ...
148649            0.00
148650    Not Provided
148651    Not Provided
148652    Not Provided
148653            0.00
Name: BasePay, Length: 148654, dtype: object

In [6]:
df["BasePay"] = pd.to_numeric(df["BasePay"] , errors= "coerce")

In [7]:
df["BasePay"] # now it is suitable

0         167411.18
1         155966.02
2         212739.13
3          77916.00
4         134401.60
            ...
148649         0.00
148650          NaN
148651          NaN
148652          NaN
148653         0.00
Name: BasePay, Length: 148654, dtype: float64

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(4), int64(2), object(7)
memory usage: 14.7+ MB

In [9]:
df["BasePay"].describe()

count    148045.000000
mean      66325.448840
std       42764.635495
min        -166.010000
25%       33588.200000
50%       65007.450000
75%       94691.050000
max      319275.010000
Name: BasePay, dtype: float64

In [10]:
mean_ = df["BasePay"].mean()
median_ = df["BasePay"].median()
mode_  = df["BasePay"].mode()

print(f"mean is {mean_} ,median is {median_} ,mode is {mode_}")

mean is 66325.4488404877 ,median is 65007.45 ,mode is 0    0.0
Name: BasePay, dtype: float64

In [11]:
df.replace(df["BasePay"].isnull() , df["BasePay"].median() , inplace= True)

In [12]:
df[df["BasePay"] == df["BasePay"].isnull()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
2896,2897,JOHN PAYNE,MANAGER VII,0.0,0.0,142245.22,NaN,142245.22,142245.22,2011,NaN,San Francisco,NaN
3263,3264,LAWRENCE BADINER,MANAGER VI,0.0,0.0,138191.99,NaN,138191.99,138191.99,2011,NaN,San Francisco,NaN
19058,19059,PETER LEONARD,FIRE FIGHTER PARAMEDIC,0.0,1630.2,64356.03,NaN,65986.23,65986.23,2011,NaN,San Francisco,NaN
20834,20835,MICHAEL COLLINS,POLICE OFFICER II,0.0,7815.78,52820.77,NaN,60636.55,60636.55,2011,NaN,San Francisco,NaN
21658,21659,LINDA ZIMMERMAN,PUBLIC HEALTH NURSE,0.0,0.0,58441.6,NaN,58441.60,58441.60,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148645,148646,Carolyn A Wilson,Human Services Technician,0.0,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148647,148648,Joann Anderson,Communications Dispatcher 2,0.0,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.0,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.0,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

**OvertimePay**

In [13]:
df["OvertimePay"].describe() # it is suitable

count     148654.0
unique     66555.0
top            0.0
freq       66103.0
Name: OvertimePay, dtype: float64

**What is the average BasePay ?**

In [14]:
df["BasePay"].describe() # it is 65007
df["BasePay"].mean()

66325.4488404877

**What is the highest amount of OvertimePay in the dataset ?**

In [15]:
df["OvertimePay"] = pd.to_numeric(df["OvertimePay"] , errors= "coerce")
df["OvertimePay"].max()

245131.88

**What is the job title of  JOSEPH DRISCOLL?**

In [16]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

**How much does JOSEPH DRISCOLL make (including benefits)?**

In [17]:
df["Benefits"] = pd.to_numeric(df["Benefits"] , errors="coerce")
df["Benefits"].value_counts()

0.00        1734
7959.18      348
4659.36      107
25699.20      83
37055.22      82
            ...
669.66         1
753.70         1
1073.31        1
662.98         1
1.24           1
Name: Benefits, Length: 98465, dtype: int64

In [18]:
JOSEPH = df[df["EmployeeName"] == "JOSEPH DRISCOLL"]
(JOSEPH["TotalPayBenefits"] ,
 JOSEPH["TotalPay"])

(24    270324.91
 Name: TotalPayBenefits, dtype: float64,
 24    270324.91
 Name: TotalPay, dtype: float64)

**What is the name of highest paid person (including benefits)?**

In [19]:
df [df['TotalPayBenefits'] == df['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [20]:
df["TotalPayBenefits"].max()

567595.43

**What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid**

In [21]:
df[df["TotalPayBenefits"] == df["TotalPayBenefits"].min()]["EmployeeName"]

148653    Joe Lopez
Name: EmployeeName, dtype: object

**What was the average (mean) BasePay of all employees per year? (2011-2014) ?**

In [24]:
df[df["BasePay"] == df["BasePay"].median()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
87317,87318,Victor Rivera-Calderon,Transit Operator,65007.45,19600.45,794.67,32442.69,85402.57,117845.26,2013,NaN,San Francisco,NaN

**How many unique job titles are there?**

**What are the top 5 most common jobs?**

In [25]:
df["JobTitle"].mode()

0    Transit Operator
Name: JobTitle, dtype: object

**How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)**

**How many people have the word Chief in their job title? (This is pretty tricky)**

**Bonus: Is there a correlation between length of the Job Title string and Salary?**

# Great Job!